---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegeneratedElements
source: html/06397740-75ab-e0a1-573d-abe6e1651277.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegeneratedElements Property

Elements regenerated in pass [Regen Index]

## Syntax (C#)
```csharp
public static FailureDefinitionId RegeneratedElements { get; }
```